# Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. Используйте для решения задачи функцию `count()`

s = input('enter smth')
print('слов в строке =',s.count(' ')+1)
