    # Пользователь вводит, отдельно, строку `s` и один символ `ch`. Необходимо выполнить поиск в строке `s` всех символов `ch`.
# Для решения НУЖНО использовать только функцию `find()`(rfind()), операторы `if` и `for`(while).





s='fdhsj fhdjskfh sdj hdsj kdsh'
ch ='h'
for i in range(len(s)):
    if s[i] = s.find('h'):
        print(s[i],end="")
